{
    "county": {
        "required": "Your county is required",
        "min": "A valid county name can not be shorter than 5 letters",
        "max": "A valid county name can not be longer than 15 letters",
        "pattern": "Your county name contains invalid characters. Please use letters and spaces"
    },
    "sub-county": {
        "required": "Your sub-county is required",
        "min": "A valid sub-county name can not be shorter than 5 letters",
        "max": "A valid sub-county name can not be longer than 15 letters",
        "pattern": "Your sub-county name contains invalid characters. Please use letters and spaces"
    },
    "area": {
        "required": "Your area is required",
        "min": "A valid area name cannot be shorter than 3 letters",
        "max": "A valid area name cannot be longer than 15 characters",
        "pattern": "Your area name contains invalid characters. Please use letters and spaces"
    },
    "city": {
        "required": "Tell us the name of your nearest city",
        "min": "A valid city name can not be shorter than 5 letters",
        "max": "A valid city name cannot be longer than 15 letters",
        "pattern": "Your city name contains invalid characters. Please use letters and spaces"
    },
    "phone-number": {
        "required": "Your phone number is required",
        "min": "Provide a valid phone number",
        "max": "Provide a valid phone number",
        "pattern": "A valid phone number can only contain numbers",
        "unique": "The phone number you entered has already been registered"
    },
    "national-id": {
        "required": "Your national id number is required",
        "min": "Provide a valid national id number",
        "max": "Provide a valid national id number",
        "pattern": "A valid national id number can only contain digits",
        "unique": "The national id number you entered has already been registered"
    },
    "email": {
        "required": "Your email address is required",
        "min": "Enter a valid email address",
        "max": "Enter a valid email address",
        "pattern": "Email address contain invalid characters",
        "constant": "Provide a valid email address",
        "unique": "The email address you entered has already been registered"
    }
}